<a href="https://colab.research.google.com/github/2303A51061/B16_PDS_1061/blob/main/Lab5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [25]:
import pandas as pd
data=[10,20,30,40,50]
index_labels=['a','b','c','d','e']
series=pd.Series(data,index=index_labels)

print(series)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [26]:
import pandas as pd
data={
    'Name':['Alice','Bob','Charlie','David'],
    'Age':[25,30,35,40],
    'City':['Hyderabad','Delhi','Chennai','Mumbai']
}
df=pd.DataFrame(data)
print(df)

      Name  Age       City
0    Alice   25  Hyderabad
1      Bob   30      Delhi
2  Charlie   35    Chennai
3    David   40     Mumbai

In [27]:
print(df['Name'])

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [28]:
print(df[['Name','City']])

      Name       City
0    Alice  Hyderabad
1      Bob      Delhi
2  Charlie    Chennai
3    David     Mumbai

In [29]:
print(df.iloc[1])

Name      Bob
Age        30
City    Delhi
Name: 1, dtype: object

In [30]:
print(df.iloc[2])

Name    Charlie
Age          35
City    Chennai
Name: 2, dtype: object

In [31]:
df['Salary']=[40000,50000,60000,70000]
print(df)

      Name  Age       City  Salary
0    Alice   25  Hyderabad   40000
1      Bob   30      Delhi   50000
2  Charlie   35    Chennai   60000
3    David   40     Mumbai   70000

In [32]:
df=df.drop('City',axis=1)
print(df)

      Name  Age  Salary
0    Alice   25   40000
1      Bob   30   50000
2  Charlie   35   60000
3    David   40   70000

In [33]:
print(df[df['Age']>30])

      Name  Age  Salary
2  Charlie   35   60000
3    David   40   70000

In [34]:
print(df['Age'].mean())

32.5

In [35]:
print(df['Age'].max())

40

In [36]:
print(df['Age'].min())

25

In [38]:
import pandas as pd
student_data={
    'Student_ID':[101,102,103,104],
    'Name':['Ravi','Neha','Kiran','Sita'],
    'Marks':[25,30,35,40],
    'Department':['CSE','ECE','MECH','CSE']

}
df=pd.DataFrame(student_data)
print("Student Data")
print(df)

Student Data
   Student_ID   Name  Marks Department
0         101   Ravi     25        CSE
1         102   Neha     30        ECE
2         103  Kiran     35       MECH
3         104   Sita     40        CSE